Repository: yeager/swedish-tm
Catalog: reviewed/catalogs/phpmyadmin-5-2.tmx
Source language: en
Languages: sv

source: Portrait
sv: Porträtt

source: Table is already in Third normal form!
sv: Tabellen är redan i tredje normalformen!

source: Show server listing as a list instead of a drop down.
sv: Visa serverlista som en lista istället för en drop-down.

source: Run SQL query/queries on table %s
sv: Kör SQL-fråga/frågor i tabellen %s

source: Plugins
sv: Insticksprogram

source: Recently used table
sv: Nyligen använd tabell

source: subquery
sv: underfråga

source: A TEXT column with a maximum length of 255 (2^8 - 1) characters, stored with a one-byte prefix indicating the length of the value in bytes
sv: En TEXT-kolumn med en maximal längd av 255 (2^8-1) tecken, lagrat med ett en-bytes prefix vilket anger längden av värdet i bytes

source: Statements to track
sv: Kommandon att spåra

source: Retain query box
sv: Behåll frågerutan

source: %s is available on this MySQL server.
sv: %s är tillgänglig på denna MySQL-server.

source: <code>INSERT IGNORE</code> statements
sv: <code>INSERT IGNORE</code>-kommandon

source: Settings will be saved in your browser's local storage.
sv: Inställningarna kommer att sparas i din webbläsare.

source: Partial texts
sv: Förkortade texter

source: Less than 80% of the query cache is being utilized.
sv: Mindre än 80 % av frågecachen utnyttjas.

source: Show arguments
sv: Visa argument

source: Track these data definition statements:
sv: Spåra dessa datadefinitioners kommandon:

source: Hide partial dependencies list
sv: Dölj partiella beroende-listan

source: Failed
sv: Misslyckades

source: Converts Boolean values to text (default 'T' and 'F'). First option is for TRUE, second for FALSE. Nonzero=true.
sv: Konverterar Booleska värden till text (standardvärden 'T' och 'F'). Första valet står för SANT, det andra för FALSKT. Nollskilt värde=sant.

source: Input transformation
sv: Transformation av indata

source: You have enabled two factor authentication, please confirm your login.
sv: Du har aktiverat tvåfaktorsautentisering. Bekräfta inloggningen.

source: Show hint
sv: Visa tips

source: How to display various action links
sv: Hur man visar olika åtgärdslänkar

source: %1$s match in <strong>%2$s</strong>
sv: %1$s träff i <strong>%2$s</strong>

source: %1$s matches in <strong>%2$s</strong>
sv: %1$s träffar i <strong>%2$s</strong>

source: Repeat headers
sv: Reparera rubriker

source: Displays hexadecimal representation of data. Optional first parameter specifies how often space will be added (defaults to 2 nibbles).
sv: Visar hexadecimal representation av data. Valfri första parameter anger hur ofta mellanslag läggs till (standardvärde: 2 tecken).

source: Confirm
sv: Bekräfta

source: Show only listed databases
sv: Visa endast listade databaser

source: Default title
sv: Standardtitel

source: Create database
sv: Skapa databas

source: The number of threads created to handle connections. If Threads_created is big, you may want to increase the thread_cache_size value. (Normally this doesn't give a notable performance improvement if you have a good thread implementation.)
sv: Antalet trådar skapade för att hantera förbindelser. Om värdet Threads_created är stort, vill du kanske öka värdet thread_cache_size. (Normalt ger detta inte någon märkbar prestandaförbättring om du har en bra trådimplementering.)

source: Query Cache usage
sv: Frågecache-användning

source: Default format; be aware that this list depends on location (database, table) and only SQL is always available.
sv: Standardformat; observera att denna lista beror på plats (databas, tabell) och endast SQL är alltid tillgängligt.

source: Suhosin warning
sv: Suhosin-varning

source: Add DROP TABLE
sv: Lägg till DROP TABLE

source: Quick steps to set up advanced features:
sv: Snabba steg för att installera avancerade funktioner:

source: Query window
sv: Sökfönster

source: Temporary tables average: %s, this value should be less than 1 per hour.
sv: Genomsnittligt antal temporära tabeller: %s. detta värde bör vara mindre än 1 per timme.

source: Delete data or table
sv: Ta bort data eller tabell

source: Indexes
sv: Index

source: Start IO Thread only
sv: Starta endast IO-tråd

source: You have no saved settings!
sv: Du har inga sparade inställningar!

source: Use TAB key to move from value to value, or CTRL+arrows to move anywhere.
sv: Använd TAB-tangenten för att flytta från värde till värde, eller CTRL+pil för att flytta vart som helst.

source: Write waits
sv: Skrivväntanden

source: Leave blank for no PDF schema support, suggested: [kbd]pma__pdf_pages[/kbd].
sv: Lämna blankt för att stänga av stöd för PDF-schema, förslag: [kbd]pma__pdf_pages[/kbd].

source: %s has been disabled for this MySQL server.
sv: %s har inaktiverats på denna MySQL-server.

source: Invalid routine type: "%s"
sv: Ogiltig rutintyp: "%s"

source: Order
sv: Ordning

source: Please enter a valid table name.
sv: Vänligen ange ett giltigt tabellnamn.

source: The query cache is not enabled.
sv: Frågecache är inte aktiverat.

source: Simplified Chinese
sv: Förenklad kinesiska

source: Table caption
sv: Tabellrubrik

source: Expand single database
sv: Expandera en enskild databas

source: Replace with:
sv: Ersätt med:

source: No Two-Factor Authentication
sv: Ingen tvåfaktorsautentisering

source: Maximum number of tables displayed in table list.
sv: Maximalt antal tabeller som visas i tabellista.

source: Defines the list of statements the auto-creation uses for new versions.
sv: Definierar lista med påståenden vilken auto-creation använder för nya versioner.

source: Add parameter
sv: Lägg till parameter

source: File is a symbolic link
sv: Filen är en symbolisk länk

source: Import from file
sv: Importera från fil

source: You have added a new user.
sv: Du har lagt till en ny användare.

source: Default transformations for External
sv: Standardomvandlingar för External

source: New bookmark
sv: Nytt bokmärke

source: Choose column to display:
sv: Välj kolumn att visa:

source: No tables found in database.
sv: Inga tabeller funna i databasen.

source: Foreign key checks
sv: Kontroll av främmande nyckel

source: Enabled
sv: Aktiverat

source: Protect binary columns
sv: Skydda binära kolumner

source: Do not abort on INSERT error
sv: Avbryt inte vid INSERT-fel

source: Partial import:
sv: Partiell import:

source: Error: FOREIGN KEY relationship could not be added!
sv: Fel: Främmande nyckel-relation kunde inte läggas till!

source: Note: If the file contains multiple tables, they will be combined into one.
sv: Obs: Om filen innehåller multipla tabeller, kommer de förenas till en.

source: Index reads from memory: %s%%, this value should be above 95%%
sv: Index som läses från minnet: %s%%, detta värde bör vara över 95%%

source: The password for %s was changed successfully.
sv: Lösenordet för %s har ändrats.

source: Go to database: %s
sv: Gå till databas: %s

source: Visualize GIS data
sv: Visualisera GIS-data

source: Please enter no more than {0} characters
sv: Ange inte mer än {0} tecken

source: both of the above<br> &nbsp; &nbsp; &nbsp; Example: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3), (4,5,6), (7,8,9)</code>
sv: båda av ovanstående<br> &nbsp; &nbsp; &nbsp; Exempel: <code>INSERT INTO tbl_name (col_A,col_B,col_C) VALUES (1,2,3), (4,5,6), (7,8,9)</code>

source: complete inserts
sv: kompletta infogningar

source: Saturday
sv: Lördag

source: Start Monitor
sv: Starta Monitor

source: %s%% of all sorts cause temporary tables, this value should be lower than 10%%.
sv: %s%% av alla sorteringar orsakar tillfälliga tabeller, detta värde bör vara lägre än 10%%.

source: Unknown security key error.
sv: Okänt fel med säkerhetsnyckeln.

source: Show/Hide tables list
sv: Visa/Göm tabellista

source: % Time
sv: Tid

source: The number of times the first entry was read from an index. If this is high, it suggests that the server is doing a lot of full index scans; for example, SELECT col1 FROM foo, assuming that col1 is indexed.
sv: Antalet gånger första posten lästes från ett index. Om detta värde är högt tyder det på att servern gör många helindex-avsökningar; t.ex. SELECT col1 FROM foo, under förutsättning att col1 är indexerad.

source: July
sv: juli

source: This method requires using an '<i>SSL connection</i>' or an '<i>unencrypted connection that encrypts the password using RSA</i>'; while connecting to the server.
sv: Denna metod kräver en '<i>SSL-anslutning</i>' eller en '<i>okrypterad anslutning som krypterar lösenordet med hjälp av RSA</i>'; vid anslutning till servern.

source: Append unit to data values
sv: Lägg till enhet till datavärdena

source: The mode for automatic recovery of crashed MyISAM tables, as set via the --myisam-recover server startup option.
sv: Inställningen för automatisk återställning av kraschade MyISAM-tabeller, som satts via serverns startparameter --myisam-recover.

source: Bytes sent
sv: Antal bitar som skickats

source: Create a new user account with the same privileges and …
sv: Skapa ett nytt användarkonto med samma privilegier och…

source: URL for reCAPTCHA siteverify
sv: URL för reCAPTCHA siteverify

source: Key block size:
sv: Nyckelblockstorlek:

source: Are you sure?
sv: Är du säker?

source: Cardinality
sv: Kardinalitet

source: Use this column to label each point
sv: Använd denna kolumn för att markera varje punkt

source: Th
sv: To

source: Quick - display only the minimal options
sv: Snabb - visa endast minimala alternativ

source: Compression
sv: Komprimering

source: Stacked
sv: Staplade

source: Connections / Processes
sv: Anslutningar / Processer

source: This feature is not supported by your web browser
sv: Denna funktion stöds inte av din webbläsare

source: The total number of data writes.
sv: Totalt antal skrivningar av data.

source: Table caption:
sv: Tabellrubrik:

source: Constraints for table
sv: Restriktioner för tabell

source: Add trigger
sv: Lägg till trigger

source: Multi-table query
sv: Fråga över flera tabeller

source: Table caption (continued):
sv: Tabellbeskrivning (forts):

source: Event %1$s has been modified.
sv: Händelsen %1$s har ändrats.

source: Well Known Text
sv: Välkänd text

source: Begin
sv: Starta

source: Simulate query
sv: Simulera körning

source: Delete tracking
sv: Ta bort spårning

source: Small/Big All
sv: Små/Stora Alla

source: SQL queries settings.
sv: Inställningar för SQL-frågor.

source: Percentage of aborted clients
sv: Andelen avslutade klienter

source: Allows to set up events for the event scheduler.
sv: Tillåter skapande av händelser för händelseschemaläggaren.

source: %1$d total, %2$d in query
sv: %1$d totalt, %2$d i fråga

source: Replace existing bookmark of same name
sv: Ersätt befintligt bokmärke med samma namn

source: Delete the view (DROP)
sv: Ta bort vyn (DROP)

source: This operation will attempt to convert your data to the new collation. In rare cases, especially where a character doesn't exist in the new collation, this process could cause the data to appear incorrectly under the new collation; in this case we suggest you revert to the original collation and refer to the tips at
sv: Denna operation kommer att försöka konvertera data till den nya sorteringsordningen. I sällsynta fall, kan särskilt där en karaktär inte finns i den nya sorteringsordningen, denna process orsaka att data visas felaktigt under den nya sorteringsordningen; i detta fall föreslår vi att u återgå till den ursprungliga sorteringen och hänvisar till tips på

source: Tracking of changes made in database. Requires the phpMyAdmin configuration storage.
sv: Spårning av ändringar i databasen. Kräver phpMyAdmin konfigurations lagring.

source: Query cache efficiency (%)
sv: Frågecachens effektivitet (%)

source: Bookmark
sv: Bokmärke

source: New table name
sv: Nytt tabellnamn

source: HTTP Basic Auth Realm name to display when doing HTTP Auth.
sv: Namn på HTTP Basic Auth Realm att visa när man gör HTTP Auth.

source: Use host table
sv: Använd värdtabell

source: The number of transactions that used the temporary binary log cache but that exceeded the value of binlog_cache_size and used a temporary file to store statements from the transaction.
sv: Antalet transaktioner som använde den temporära binära loggcachen, men som överskred värdet binlog_cache_size och använde en temporär fil för att lagra satser från transaktionen.

source: Put columns names in the first row
sv: Sätt kolumnnamn på första raden

source: Edit ENUM/SET values
sv: Redigera värden på ENUM/SET

source: Default transformations
sv: Standardomvandlingar

source: Host authorization rules
sv: Behörighetsregler för host

source: Validation failed for the input string %s.
sv: Valideringen misslyckades för Indatasträngen %s.

source: For each column below, please select the <b>minimal set</b> of columns among given set whose values combined together are sufficient to determine the value of the column.
sv: För varje kolumn nedan, Välj <b>minimal uppsättning</b> kolumner bland de givna värden som kombinerade är tillräckliga för att fastställa totalvärdet för kolumnen.

source: Unknown table status:
sv: Okänd tabellstatus:

source: Current values are tmp_table_size: %s, max_heap_table_size: %s
sv: Nuvarande värden är tmp_table_size: %s, max_heap_table_size:%s

source: Set value: %s
sv: Ange värde: %s

source: While there is nothing wrong with a high amount of row sorting, you might want to make sure that the queries which require a lot of sorting use indexed columns in the ORDER BY clause, as this will result in much faster sorting.
sv: Även om en stor mängd radsortering inte är fel bör du se till att frågor som kräver mycket sortering använder indexerade kolumner i ORDER BY-satsen. Det ger betydligt snabbare sortering.

source: Tables:
sv: Tabeller:

source: Label column
sv: Etikett kolumn

source: - none -
sv: - ingen -

source: Your export is incomplete, due to a low execution time limit at the PHP level!
sv: Din export är inkomplett på grund av en låg exekveringstidsgräns på PHP-nivå!

source: View a structure's contents by clicking on its name.
sv: Visa en strukturs innehåll genom att klicka på namnet.

source: Current query cache size: %s
sv: Nuvarande storlek på frågecache: %s

source: May be approximate. See [doc@faq3-11]FAQ 3.11[/doc].
sv: Kan vara ungefärligt. Se [doc@faq3-11]FAQ 3.11[/doc].

source: Total size of buffer pool, in pages.
sv: Total storlek på buffert, i antal sidor.

source: InnoDB buffer pool size
sv: InnoDB bufferpoolstorlek

source: Cannot save settings, submitted form contains errors!
sv: Kan inte spara inställningar, sänt formulär innehåller fel!

source: Options:
sv: Alternativ:

source: Show BLOB contents
sv: Visa BLOB-innehåll

source: %sZip decompression%s requires functions (%s) which are unavailable on this system.
sv: %sZip dekompression%s kräver funktioner (%s) som inte är tillgängliga på detta system.

source: Please add at least one variable to the series!
sv: Lägg till minst en variabel till serien!

source: Timeline
sv: Tidslinje

source: Tracking is not active.
sv: Spårning är inaktiv.

source: Please enter a valid page name
sv: Vänligen ange ett giltigt sidnamn

source: Servers display options.
sv: Visningsalternativ för servrar.

source: Defines which type of editing controls should be used for CHAR and VARCHAR columns; [kbd]input[/kbd] - allows limiting of input length, [kbd]textarea[/kbd] - allows newlines in columns.
sv: Anger vilken typ av redigeringskontroll som ska användas för CHAR- och VARCHAR-fält; [kbd]input[/kbd] - tillåter begränsning av inmatningens längd, [kbd]textarea[/kbd] - tillåter radbrytningar i kolumner.

source: Table is already in second normal form.
sv: Tabellen är redan i den andra normalformen.

source: In order to put the original table '%1$s' into Second normal form we need to create the following tables:
sv: För ändra den ursprungliga tabellen '%1$s' till andra normalformen måste vi skapa följande tabeller:

source: Choose column to display
sv: Välj kolumn att visa

source: Click on the bar to scroll to top of page
sv: Klicka på bommen för att förflytta dig till toppen av sidan

source: Could not add %1$s as they already exist in central list!
sv: Det gick inte att lägga till %1$s eftersom de redan finns i centrala lista!

source: Virtuality
sv: Virtuell

source: Column name
sv: Kolumnnamn

source: HTTP authentication
sv: HTTP-autentisering

source: PM
sv: em

source: deleted
sv: raderad

source: A collection of polygons
sv: En samling polygoner

source: Clear series
sv: Rensa serie

source: Import currencies <i>(ex. $5.00 to 5.00)</i>
sv: Importera valutor <i>(t.ex. $5.00 blir 5.00)</i>

source: The number of queries that have taken more than long_query_time seconds.
sv: Antalet frågor som har tagit mer än long_query_time sekunder.

source: Average load
sv: Genomsnittlig last

source: Log in
sv: Logga in

source: Console height
sv: Konsolens höjd

source: Note: You are attempting to edit privileges of the user with which you are currently logged in.
sv: Obs: Du försöker redigera behörigheter för den användare som du är inloggad som.

source: Log name
sv: Loggnamn

source: extended inserts
sv: utökade infogningar

source: Authentication method to use.
sv: Autentiseringsmetod att använda.

source: Enable slow query logging by setting {log_slow_queries} to 'ON'. This will help troubleshooting badly performing queries.
sv: Aktivera långsam frågeloggning genom att sätta {log_slow_queries} till "ON". Detta kommer att förbättra vid felsökning av dålig prestanda frågor.

source: To zoom in, select a section of the plot with the mouse.
sv: För att zooma in, välj en del av grafen med musen.

source: The configuration storage is not ready for the central list of columns feature.
sv: Konfigurationen lagring är inte redo för den centrala listan över kolumner funktionen.

source: Submit
sv: Sänd

source: Row length
sv: Radlängd

source: Traditional Chinese
sv: Traditionell kinesiska

source: Clear fast filter
sv: Rensa snabbfilter

source: Flush query cache
sv: Rensa frågecache

source: License
sv: Licens

source: Key cache
sv: Nyckelcache

source: See replica status table
sv: Visa tabellen med replikstatus

source: The total number of data reads.
sv: Totalt antal läsningar av data.

source: Notice
sv: Notis

source: The number of non-cached queries (not cachable, or not cached due to the query_cache_type setting).
sv: Antalet icke-cachade frågor (inte möjliga att cacha eller inte cachade pga inställningen query_cache_type).

source: No redundant column
sv: Ingen överflödig kolumn

source: Prefix
sv: Lägg till förled

source: Remove selected
sv: Ta bort markerade

source: Configure two-factor authentication
sv: Konfigurera tvåfaktorsautentisering

source: Browser display transformation
sv: Webbläsaromvandling

source: Please enter a value between {0} and {1}
sv: Ange ett värde mellan {0} och {1}

source: Analyze table
sv: Analysera tabell

source: Password is too long!
sv: Lösenordet är för långt!

source: Select which functions will be used for character set conversion.
sv: Välj vilka funktioner som kommer användas för konvertering av teckenuppsättning.

source: Something went wrong.
sv: Något gick fel.

source: Monitor refresh failed
sv: Uppdateringen av övervakningen misslyckades

source: Exporting rows from "%s" table
sv: Exportera rader från tabellen "%s"

source: Internal relation
sv: Intern relation

source: Web server
sv: Webbserver

source: Show views in tree
sv: Visa vyer som träd

source: Variable %d:
sv: Miljövariabeln %d:

source: Your browser will refresh all displayed charts in a regular interval. You may add charts and change the refresh rate under 'Settings', or remove any chart using the cog icon on each respective chart.
sv: Din webbläsare kommer uppdatera alla diagram som visas med jämna mellanrum. Du kan lägga till diagram och ändra uppdateringsfrekvensen under "Inställningar", eller ta bort diagram med kugghjulsikonen på respektive diagram.

source: Percona documentation is at <a href="https://www.percona.com/software/documentation/">https://www.percona.com/software/documentation/</a>
sv: Percona dokumentation finns på <a href="https://www.percona.com/software/documentation/"> https://www.percona.com/software/documentation/</a>

source: Choose "GeomFromText" from the "Function" column and paste the string below into the "Value" field.
sv: Välj "GeomFromText" i kolumnen "Funktion" och klistra in strängen i fältet "Värde".

source: Especially on a system with a lot of writes to InnoDB tables you should set {innodb_log_file_size} to 25% of {innodb_buffer_pool_size}. However the bigger this value, the longer the recovery time will be when database crashes, so this value should not be set much higher than 256 MiB. Please note however that you cannot simply change the value of this variable. You need to shutdown the server, remove the InnoDB log files, set the new value in my.cnf, start the server, then check the error logs if everything went fine. See also <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">this blog entry</a>
sv: På system med många skrivningar till InnoDB-tabeller bör du ange {innodb_log_file_size} till 25 % av {innodb_buffer_pool_size}. Ju större värdet är, desto längre blir återställningstiden efter en databaskrasch, så värdet bör inte anges mycket högre än 256 MiB. Du kan inte bara ändra värdet på variabeln. Stäng av servern, ta bort InnoDB-loggfilerna, ange det nya värdet i my.cnf, starta servern och kontrollera sedan felloggarna. Se även <a href="https://mysqldatabaseadministration.blogspot.com/2007/01/increase-innodblogfilesize-proper-way.html">det här blogginlägget</a>.

source: The phpMyAdmin Monitor can assist you in optimizing the server configuration and track down time intensive queries. For the latter you will need to set log_output to 'TABLE' and have either the slow_query_log or general_log enabled. Note however, that the general_log produces a lot of data and increases server load by up to 15%.
sv: phpMyAdmin Monitor hjälpa dig optimera serverkonfigurationen och spåra tidsintensiva frågor. För det senare måste du ställa log_output till "TABLE" och ha antingen slow_query_log eller general_log aktiverat. Observera att general_log producerar mycket data och ökar lasten på servern med upp till 15%.

source: Move the columns by dragging them up and down.
sv: Flytta kolumner genom att dra dem uppåt och nedåt.

source: Remove selected user accounts
sv: Ta bort markerade användarkonton

source: Server configuration
sv: Serverkonfiguration

source: Exporting tables from "%s" database
sv: Exportera tabeller från databasen "%s"

source: Database-level tabs
sv: Flikar på databasnivå

source: Through this operation, MySQL attempts to map the data values between collations. If the character sets are incompatible, there may be data loss and this lost data may <b>NOT</b> be recoverable simply by changing back the column collation(s). <b>To convert existing data, it is suggested to use the column(s) editing feature (the "Change" Link) on the table structure page. </b>
sv: Genom denna operation försöker MySQL kartlägga värden mellan sorteringar. Om teckenuppsättningarna är inkompatibla kan dataförlust ske och förlorad data kan vara <b>OMÖJLIG</b> att återställa genom att ändra tillbaks kolumnen/kolumnernas sortering. <b>För att konvertera existerande data föreslås användande av kolumnens/kolumnernas redigeringsverktyg ("Ändra") på tabellstruktur sidan.</b>

source: Query took %01.4f seconds.
sv: Frågan tog %01.4f sekunder.

source: Add %s column(s)
sv: Lägg till %s fält

source: The number of "random" read-aheads InnoDB initiated. This happens when a query is to scan a large portion of a table but in random order.
sv: Antalet "slumpmässiga" läsningar i förväg som InnoDB initierat. Detta sker när en fråga ska avsöka en stor del av en tabell men i slumpmässig ordning.
